<h1>Table of Contents<span class="tocSkip"></span></h1>
<div class="toc"><ul class="toc-item"><li><span><a href="#Introducci칩n" data-toc-modified-id="Introducci칩n-1"><span class="toc-item-num">1&nbsp;&nbsp;</span>Introducci칩n</a></span></li><li><span><a href="#Instalaci칩n" data-toc-modified-id="Instalaci칩n-2"><span class="toc-item-num">2&nbsp;&nbsp;</span>Instalaci칩n</a></span></li><li><span><a href="#Introducci칩n-a-las-estructuras-de-datos-de-pandas" data-toc-modified-id="Introducci칩n-a-las-estructuras-de-datos-de-pandas-3"><span class="toc-item-num">3&nbsp;&nbsp;</span>Introducci칩n a las estructuras de datos de pandas</a></span><ul class="toc-item"><li><span><a href="#Series" data-toc-modified-id="Series-3.1"><span class="toc-item-num">3.1&nbsp;&nbsp;</span>Series</a></span></li></ul></li><li><span><a href="#Datos-de-lectura/escritura" data-toc-modified-id="Datos-de-lectura/escritura-4"><span class="toc-item-num">4&nbsp;&nbsp;</span>Datos de lectura/escritura</a></span><ul class="toc-item"><li><span><a href="#Cargamos-datos-en-formato-CSV" data-toc-modified-id="Cargamos-datos-en-formato-CSV-4.1"><span class="toc-item-num">4.1&nbsp;&nbsp;</span>Cargamos datos en formato CSV</a></span></li><li><span><a href="#Visualizamos-las-primeras-filas" data-toc-modified-id="Visualizamos-las-primeras-filas-4.2"><span class="toc-item-num">4.2&nbsp;&nbsp;</span>Visualizamos las primeras filas</a></span></li><li><span><a href="#Visualizamos-las-칰ltimas-filas" data-toc-modified-id="Visualizamos-las-칰ltimas-filas-4.3"><span class="toc-item-num">4.3&nbsp;&nbsp;</span>Visualizamos las 칰ltimas filas</a></span></li><li><span><a href="#Visualizamos-una-muestra-aleatoria" data-toc-modified-id="Visualizamos-una-muestra-aleatoria-4.4"><span class="toc-item-num">4.4&nbsp;&nbsp;</span>Visualizamos una muestra aleatoria</a></span></li></ul></li><li><span><a href="#Operaciones-b치sicas-con-los-dataframes" data-toc-modified-id="Operaciones-b치sicas-con-los-dataframes-5"><span class="toc-item-num">5&nbsp;&nbsp;</span>Operaciones b치sicas con los dataframes</a></span><ul class="toc-item"><li><span><a href="#Seleccionamos-una-columna" data-toc-modified-id="Seleccionamos-una-columna-5.1"><span class="toc-item-num">5.1&nbsp;&nbsp;</span>Seleccionamos una columna</a></span></li><li><span><a href="#Seleccionamos-varias-columnas" data-toc-modified-id="Seleccionamos-varias-columnas-5.2"><span class="toc-item-num">5.2&nbsp;&nbsp;</span>Seleccionamos varias columnas</a></span></li><li><span><a href="#Obtener-los-valores-칰nicos-de-una-columna-(es-decir,-una-serie)" data-toc-modified-id="Obtener-los-valores-칰nicos-de-una-columna-(es-decir,-una-serie)-5.3"><span class="toc-item-num">5.3&nbsp;&nbsp;</span>Obtener los valores 칰nicos de una columna (es decir, una serie)</a></span></li><li><span><a href="#Filtramos-los-datos-por-el-valor-de-las-columnas" data-toc-modified-id="Filtramos-los-datos-por-el-valor-de-las-columnas-5.4"><span class="toc-item-num">5.4&nbsp;&nbsp;</span>Filtramos los datos por el valor de las columnas</a></span></li><li><span><a href="#Copia-de-un-dataframe-y-renombrar-columnas" data-toc-modified-id="Copia-de-un-dataframe-y-renombrar-columnas-5.5"><span class="toc-item-num">5.5&nbsp;&nbsp;</span>Copia de un dataframe y renombrar columnas</a></span><ul class="toc-item"><li><span><a href="#Podemos-renombrar-las-columnas-machacando-el-atributo-de-la-instancia...-쯢s-suena-esto?" data-toc-modified-id="Podemos-renombrar-las-columnas-machacando-el-atributo-de-la-instancia...-쯢s-suena-esto?-5.5.1"><span class="toc-item-num">5.5.1&nbsp;&nbsp;</span>Podemos renombrar las columnas machacando el atributo de la instancia... 쯢s suena esto?</a></span></li></ul></li><li><span><a href="#Borramos-columnas" data-toc-modified-id="Borramos-columnas-5.6"><span class="toc-item-num">5.6&nbsp;&nbsp;</span>Borramos columnas</a></span></li><li><span><a href="#Borramos-filas" data-toc-modified-id="Borramos-filas-5.7"><span class="toc-item-num">5.7&nbsp;&nbsp;</span>Borramos filas</a></span></li><li><span><a href="#Reset_index-y-set_index" data-toc-modified-id="Reset_index-y-set_index-5.8"><span class="toc-item-num">5.8&nbsp;&nbsp;</span>Reset_index y set_index</a></span></li><li><span><a href="#Operaciones-entre-columnas" data-toc-modified-id="Operaciones-entre-columnas-5.9"><span class="toc-item-num">5.9&nbsp;&nbsp;</span>Operaciones entre columnas</a></span></li></ul></li><li><span><a href="#Apply-!!" data-toc-modified-id="Apply-!!-6"><span class="toc-item-num">6&nbsp;&nbsp;</span>Apply !!</a></span></li><li><span><a href="#Df-.loc-e-.iloc" data-toc-modified-id="Df-.loc-e-.iloc-7"><span class="toc-item-num">7&nbsp;&nbsp;</span>Df .loc e .iloc</a></span><ul class="toc-item"><li><span><a href="#Seleccionar-filas-y-columnas-en-Pandas-mediante-posici칩n-con-iloc" data-toc-modified-id="Seleccionar-filas-y-columnas-en-Pandas-mediante-posici칩n-con-iloc-7.1"><span class="toc-item-num">7.1&nbsp;&nbsp;</span>Seleccionar filas y columnas en Pandas mediante posici칩n con iloc</a></span></li><li><span><a href="#Seleccionar-filas-y-columnas-en-Pandas-en-base-a-etiquetas-con-loc" data-toc-modified-id="Seleccionar-filas-y-columnas-en-Pandas-en-base-a-etiquetas-con-loc-7.2"><span class="toc-item-num">7.2&nbsp;&nbsp;</span>Seleccionar filas y columnas en Pandas en base a etiquetas con loc</a></span><ul class="toc-item"><li><span><a href="#En-base-a-etiqueta" data-toc-modified-id="En-base-a-etiqueta-7.2.1"><span class="toc-item-num">7.2.1&nbsp;&nbsp;</span>En base a etiqueta</a></span></li><li><span><a href="#En-base-a-una-condici칩n" data-toc-modified-id="En-base-a-una-condici칩n-7.2.2"><span class="toc-item-num">7.2.2&nbsp;&nbsp;</span>En base a una condici칩n</a></span></li></ul></li></ul></li><li><span><a href="#An치lisis-exploratorio-de-un-dataframe" data-toc-modified-id="An치lisis-exploratorio-de-un-dataframe-8"><span class="toc-item-num">8&nbsp;&nbsp;</span>An치lisis exploratorio de un dataframe</a></span><ul class="toc-item"><li><span><a href="#Buscamos-valores-nulos" data-toc-modified-id="Buscamos-valores-nulos-8.1"><span class="toc-item-num">8.1&nbsp;&nbsp;</span>Buscamos valores nulos</a></span></li><li><span><a href="#Borramos-los-valores-nulos" data-toc-modified-id="Borramos-los-valores-nulos-8.2"><span class="toc-item-num">8.2&nbsp;&nbsp;</span>Borramos los valores nulos</a></span></li><li><span><a href="#C칩mo-rellenar-los-datos-que-faltan" data-toc-modified-id="C칩mo-rellenar-los-datos-que-faltan-8.3"><span class="toc-item-num">8.3&nbsp;&nbsp;</span>C칩mo rellenar los datos que faltan</a></span></li></ul></li><li><span><a href="#Agregaci칩n-de-datos" data-toc-modified-id="Agregaci칩n-de-datos-9"><span class="toc-item-num">9&nbsp;&nbsp;</span>Agregaci칩n de datos</a></span></li><li><span><a href="#Summaary" data-toc-modified-id="Summaary-10"><span class="toc-item-num">10&nbsp;&nbsp;</span>Summaary</a></span></li><li><span><a href="#Further-materials" data-toc-modified-id="Further-materials-11"><span class="toc-item-num">11&nbsp;&nbsp;</span>Further materials</a></span></li></ul></div>

#Pandas

![pandas](https://media.giphy.com/media/nVsLCrW5iHf6E/giphy.gif)

Mi gif favorito para la que, a partir de ahora, ser치 tu librer칤a favorita 游땘

##Introducci칩n 
Pandas es, sin duda, la biblioteca m치s utilizada en el ecosistema de Python para el an치lisis y la manipulaci칩n de datos. Es r치pida, potente, flexible, f치cil de usar y de c칩digo abierto. 


Entre sus principales caracter칤sticas est치n
* Un objeto **DataFrame** r치pido y eficiente para la manipulaci칩n de datos con indexaci칩n integrada
* **Lectura y escritura** de datos en multitud de formatos: Microsoflt Excel, CSV, bases de datos SQL, etc;
* M칠todos integrados y eficientes para todo tipo de manipulaci칩n de datos: datos faltantes, subconjunto, uni칩n, fusi칩n, etc; 
* Facilidad para trabajar con datos temporales (de hecho, Pandas se llama as칤 por "PANnel DAta") 
* Buena **integraci칩n con otras librer칤as** de an치lisis de datos o Machine learning: scikit-learn, scipy, seaborn, plotly, etc;
* Es **ampliamente utilizado** tanto en el sector privado como en el acad칠mico     


Pandas proporciona estructuras de datos de alto nivel y funciones dise침adas para hacer que el trabajo con datos estructurados o tabulares sea r치pido, f치cil y expresivo. Desde su aparici칩n en 2010, ha ayudado a que Python sea un entorno de an치lisis de datos potente y productivo. Los principales objetos de pandas que se utilizar치n en este libro son el DataFrame, una estructura de datos tabular orientada a columnas con etiquetas de filas y columnas, y la Serie, un objeto de matriz unidimensional etiquetado.

Pandas combina las ideas de alto rendimiento de NumPy con las capacidades flexibles de manipulaci칩n de datos de las hojas de c치lculo y las bases de datos relacionales (como SQL). Proporciona una sofisticada funcionalidad de indexaci칩n para facilitar la remodelaci칩n, el corte y la divisi칩n, la realizaci칩n de agregaciones y la selecci칩n de subconjuntos de datos.

![image](https://thumbor.forbes.com/thumbor/960x0/https%3A%2F%2Fblogs-images.forbes.com%2Fgilpress%2Ffiles%2F2016%2F03%2FTime-1200x511.jpg)



Fuente: [Forbes](https://www.forbes.com/sites/gilpress/2016/03/23/data-preparation-most-time-consuming-least-enjoyable-data-science-task-survey-says/#1ba071616f63)

##Instalaci칩n

Lo primerito que deber치s hacer, siempre ser치     
pip install pandas

In [1]:
import pandas as pd

## Introducci칩n a las estructuras de datos de pandas
Para empezar con pandas, necesitar치s sentirte c칩modo con sus dos estructuras de datos de trabajo: Series y DataFrame. Aunque no son una soluci칩n universal para todos los problemas, proporcionan una base s칩lida y f치cil de usar para la mayor칤a de las aplicaciones.

### Series
Una Serie es un objeto tipo array unidimensional que contiene una secuencia de valores (de tipos similares a los de NumPy) y un array asociado de etiquetas de datos, llamado su 칤ndice. La Serie m치s sencilla se forma a partir de un 칰nico array de datos:

In [2]:
serie = pd.Series([1,2,3,4,6,78,89,54,356,787,65])
serie

0       1
1       2
2       3
3       4
4       6
5      78
6      89
7      54
8     356
9     787
10     65
dtype: int64

La representaci칩n en cadena de una Serie mostrada interactivamente muestra el 칤ndice a la izquierda y los valores a la derecha. Como no especificamos un 칤ndice para los datos, se crea uno por defecto formado por los enteros 0 a N - 1 (donde N es la longitud de los datos). Puedes obtener la representaci칩n del array y el objeto 칤ndice de la Serie a trav칠s de sus atributos values e index, respectivamente:

In [5]:
serie.values

array([  1,   2,   3,   4,   6,  78,  89,  54, 356, 787,  65])

In [6]:
serie.index

RangeIndex(start=0, stop=11, step=1)

Otra forma de pensar en una Serie es como un dict ordenado de longitud fija, ya que es un mapeo de valores de 칤ndice a valores de datos. Se puede utilizar en muchos contextos en los que se podr칤a utilizar un diccionario.
Si tienes datos contenidos en un dict de Python, puedes crear una Serie a partir de ellos pasando el dict:

In [8]:
sdata = {'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}
serie2 = pd.Series(sdata)
serie2

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

Cuando s칩lo se pasa un dict, el 칤ndice de la Serie resultante tendr치 las claves del dict en orden. Puedes anular esto pasando las claves del dict en el orden que desee que aparezcan en la Serie resultante:

In [9]:
estados = ['California', 'Ohio', 'Oregon', 'Texas']
serie3 = pd.Series(sdata,index = estados)
serie3

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [11]:
serie3.index

Index(['California', 'Ohio', 'Oregon', 'Texas'], dtype='object')

Aqu칤, los tres valores encontrados en sdata se colocaron en los lugares apropiados, pero como no se encontr칩 ning칰n valor para 'California', aparece como NaN (no es un n칰mero), lo que se considera en pandas para marcar valores perdidos o NA. Como "Utah" no se incluy칩 en los estados, se excluye del objeto resultante.

In [ ]:
# Buscar valores NA

In [10]:
pd.isnull(serie3)

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

## Datos de lectura/escritura

Pandas puede leer y escribir datos de una gran variedad de formatos. [Lee la documentaci칩n](https://pandas.pydata.org/pandas-docs/stable/user_guide/io.html)
Aunque una de las m치s comunes es a partir de un dictado de listas de igual longitud o arrays NumPy:

In [14]:
# Desde un diccionario
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
        'year': [2000, 2001, 2002, 2001, 2002, 2003],
        'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}

frame = pd.DataFrame(data)
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [15]:
#Desde una lista de diccionarios
datos = [{'nombre': 'Fer',
               'apellido': 'Costa',
               'email': 'fer.costa@ironhack.com',
               'vacaciones': 30,
               'saludo': lambda : print('Holi, soy Fer, hacedme lo primerito la Pull Request')}, 
         
         {'nombre': 'Ana',
               'apellido': 'Garc칤a',
                  'email': 'ana.garcia@ironhack.com',
               'vacaciones': 30,
               'saludo': lambda : print('Hola, soy Ana, cuidado con los print infinitos') }]
len(datos)

2

In [16]:
data = pd.DataFrame(datos)
data

,nombre,apellido,email,vacaciones,saludo
0,Fer,Costa,fer.costa@ironhack.com,30,<function <lambda> at 0x7fec87680af0>
1,Ana,Garc칤a,ana.garcia@ironhack.com,30,<function <lambda> at 0x7fec87680ca0>

In [17]:
print(data)

  nombre apellido                    email  vacaciones  \
0    Fer    Costa   fer.costa@ironhack.com          30
1    Ana   Garc칤a  ana.garcia@ironhack.com          30

                                  saludo
0  <function <lambda> at 0x7fec87680af0>
1  <function <lambda> at 0x7fec87680ca0>

In [18]:
display(data)

,nombre,apellido,email,vacaciones,saludo
0,Fer,Costa,fer.costa@ironhack.com,30,<function <lambda> at 0x7fec87680af0>
1,Ana,Garc칤a,ana.garcia@ironhack.com,30,<function <lambda> at 0x7fec87680ca0>

Como estamos usando Jupyter Notebook, los objetos DataFrame de pandas se mostrar치n como una tabla HTML m치s amigable para el navegador.

###Cargamos datos en formato CSV

In [21]:
df = pd.read_csv("../datasets/avocado_kaggle.csv")
df

,Unnamed: 0,Date,AveragePrice,Total Volume,4046,4225,4770,Total Bags,Small Bags,Large Bags,XLarge Bags,type,year,region
0,0,2015-12-27,1.33,64236.62,1036.74,54454.85,48.16,8696.87,8603.62,93.25,0.0,conventional,2015,Albany
1,1,2015-12-20,1.35,54876.98,674.28,44638.81,58.33,9505.56,9408.07,97.49,0.0,conventional,2015,Albany
2,2,2015-12-13,0.93,118220.22,794.70,109149.67,130.50,8145.35,8042.21,103.14,0.0,conventional,2015,Albany
3,3,2015-12-06,1.08,78992.15,1132.00,71976.41,72.58,5811.16,5677.40,133.76,0.0,conventional,2015,Albany
4,4,2015-11-29,1.28,51039.60,941.48,43838.39,75.78,6183.95,5986.26,197.69,0.0,conventional,2015,Albany
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
18244,7,2018-02-04,1.63,17074.83,2046.96,1529.20,0.00,13498.67,13066.82,431.85,0.0,organic,2018,WestTexNewMexico
18245,8,2018-01-28,1.71,13888.04,1191.70,3431.50,0.00,9264.84,8940.04,324.80,0.0,organic,2018,WestTexNewMexico
18246,9,2018-01-21,1.87,13766.76,1191.92,2452.79,727.94,9394.11,9351.80,42.31,0.0,organic,2018,WestTexNewMexico
18247,10,2018-01-14,1.93,16205.22,1527.63,2981.04,727.01,10969.54,10919.54,50.00,0.0,organic,2018,WestTexNewMexico
18248,11,2018-01-07,1.62,17489.58,2894.77,2356.13,224.53,12014.15,11988.14,26.01,0.0,organic,2018,WestTexNewMexico

###Visualizamos las primeras filas

In [22]:
df.head()

,Unnamed: 0,Date,AveragePrice,Total Volume,4046,4225,4770,Total Bags,Small Bags,Large Bags,XLarge Bags,type,year,region
0,0,2015-12-27,1.33,64236.62,1036.74,54454.85,48.16,8696.87,8603.62,93.25,0.0,conventional,2015,Albany
1,1,2015-12-20,1.35,54876.98,674.28,44638.81,58.33,9505.56,9408.07,97.49,0.0,conventional,2015,Albany
2,2,2015-12-13,0.93,118220.22,794.70,109149.67,130.50,8145.35,8042.21,103.14,0.0,conventional,2015,Albany
3,3,2015-12-06,1.08,78992.15,1132.00,71976.41,72.58,5811.16,5677.40,133.76,0.0,conventional,2015,Albany
4,4,2015-11-29,1.28,51039.60,941.48,43838.39,75.78,6183.95,5986.26,197.69,0.0,conventional,2015,Albany

Por defecto head me muestra las 5 primeras filas, puedo ver algunas m치s o algunas menos pas치ndole un n칰mero como par치metro

In [24]:
df.head(3)

,Unnamed: 0,Date,AveragePrice,Total Volume,4046,4225,4770,Total Bags,Small Bags,Large Bags,XLarge Bags,type,year,region
0,0,2015-12-27,1.33,64236.62,1036.74,54454.85,48.16,8696.87,8603.62,93.25,0.0,conventional,2015,Albany
1,1,2015-12-20,1.35,54876.98,674.28,44638.81,58.33,9505.56,9408.07,97.49,0.0,conventional,2015,Albany
2,2,2015-12-13,0.93,118220.22,794.70,109149.67,130.50,8145.35,8042.21,103.14,0.0,conventional,2015,Albany

###Visualizamos las 칰ltimas filas

In [25]:
df.tail()

,Unnamed: 0,Date,AveragePrice,Total Volume,4046,4225,4770,Total Bags,Small Bags,Large Bags,XLarge Bags,type,year,region
18244,7,2018-02-04,1.63,17074.83,2046.96,1529.20,0.00,13498.67,13066.82,431.85,0.0,organic,2018,WestTexNewMexico
18245,8,2018-01-28,1.71,13888.04,1191.70,3431.50,0.00,9264.84,8940.04,324.80,0.0,organic,2018,WestTexNewMexico
18246,9,2018-01-21,1.87,13766.76,1191.92,2452.79,727.94,9394.11,9351.80,42.31,0.0,organic,2018,WestTexNewMexico
18247,10,2018-01-14,1.93,16205.22,1527.63,2981.04,727.01,10969.54,10919.54,50.00,0.0,organic,2018,WestTexNewMexico
18248,11,2018-01-07,1.62,17489.58,2894.77,2356.13,224.53,12014.15,11988.14,26.01,0.0,organic,2018,WestTexNewMexico

Excatamente igual que con .head() le pasamos un par치metro a .tail()

In [26]:
df.tail(3)

,Unnamed: 0,Date,AveragePrice,Total Volume,4046,4225,4770,Total Bags,Small Bags,Large Bags,XLarge Bags,type,year,region
18246,9,2018-01-21,1.87,13766.76,1191.92,2452.79,727.94,9394.11,9351.80,42.31,0.0,organic,2018,WestTexNewMexico
18247,10,2018-01-14,1.93,16205.22,1527.63,2981.04,727.01,10969.54,10919.54,50.00,0.0,organic,2018,WestTexNewMexico
18248,11,2018-01-07,1.62,17489.58,2894.77,2356.13,224.53,12014.15,11988.14,26.01,0.0,organic,2018,WestTexNewMexico

### Visualizamos una muestra aleatoria

In [ ]:
 #si no le pasamos un par치metro, visualiza una sola fila de forma aleatoria.

In [30]:
df.sample()

,Unnamed: 0,Date,AveragePrice,Total Volume,4046,4225,4770,Total Bags,Small Bags,Large Bags,XLarge Bags,type,year,region
4988,48,2016-01-24,0.85,564637.66,104831.87,157896.39,21607.39,280302.01,238110.78,42191.23,0.0,conventional,2016,SanDiego

In [31]:
df.sample(3)

,Unnamed: 0,Date,AveragePrice,Total Volume,4046,4225,4770,Total Bags,Small Bags,Large Bags,XLarge Bags,type,year,region
7080,33,2017-05-14,1.35,241194.43,139087.23,25294.95,347.82,76464.43,49414.09,10375.34,16675.00,conventional,2017,NewOrleansMobile
5407,51,2016-01-03,1.34,69200.73,839.36,47417.06,24.66,20919.65,20919.65,0.00,0.00,conventional,2016,Syracuse
805,25,2015-07-05,1.13,3774004.27,502233.05,2055125.98,442059.88,774585.36,606612.51,140253.50,27719.35,conventional,2015,GreatLakes

##Operaciones b치sicas con los dataframes

###Seleccionamos una columna

In [35]:
columna_type = df.type

In [36]:
columna_type

0        conventional
1        conventional
2        conventional
3        conventional
4        conventional
             ...
18244         organic
18245         organic
18246         organic
18247         organic
18248         organic
Name: type, Length: 18249, dtype: object

In [37]:
type(columna_type)

pandas.core.series.Series

In [34]:
df["Total Bags"]

0         8696.87
1         9505.56
2         8145.35
3         5811.16
4         6183.95
           ...
18244    13498.67
18245     9264.84
18246     9394.11
18247    10969.54
18248    12014.15
Name: Total Bags, Length: 18249, dtype: float64

In [ ]:
#O dos :), o las que queramos

In [39]:
reducido = df[["Date","year"]]
reducido

             Date  year
0      2015-12-27  2015
1      2015-12-20  2015
2      2015-12-13  2015
3      2015-12-06  2015
4      2015-11-29  2015
...           ...   ...
18244  2018-02-04  2018
18245  2018-01-28  2018
18246  2018-01-21  2018
18247  2018-01-14  2018
18248  2018-01-07  2018

[18249 rows x 2 columns]

###Seleccionamos varias columnas

In [43]:
columnas = ['Date', 'AveragePrice', 'Total Volume']

In [44]:
#le podemos pasar directamente una lista con los nombres de las columnas
reducido2 = df[columnas]
reducido2

             Date  AveragePrice  Total Volume
0      2015-12-27          1.33      64236.62
1      2015-12-20          1.35      54876.98
2      2015-12-13          0.93     118220.22
3      2015-12-06          1.08      78992.15
4      2015-11-29          1.28      51039.60
...           ...           ...           ...
18244  2018-02-04          1.63      17074.83
18245  2018-01-28          1.71      13888.04
18246  2018-01-21          1.87      13766.76
18247  2018-01-14          1.93      16205.22
18248  2018-01-07          1.62      17489.58

[18249 rows x 3 columns]

In [ ]:
# Listar los nombres de columnas de un dataframe

In [45]:
df.columns

Index(['Unnamed: 0', 'Date', 'AveragePrice', 'Total Volume', '4046', '4225',
       '4770', 'Total Bags', 'Small Bags', 'Large Bags', 'XLarge Bags', 'type',
       'year', 'region'],
      dtype='object')

In [46]:
columnas_data = list(df.columns)
print(columnas_data)

['Unnamed: 0', 'Date', 'AveragePrice', 'Total Volume', '4046', '4225', '4770', 'Total Bags', 'Small Bags', 'Large Bags', 'XLarge Bags', 'type', 'year', 'region']

### Obtener los valores 칰nicos de una columna (es decir, una serie)

In [49]:
df.region.unique()

array(['Albany', 'Atlanta', 'BaltimoreWashington', 'Boise', 'Boston',
       'BuffaloRochester', 'California', 'Charlotte', 'Chicago',
       'CincinnatiDayton', 'Columbus', 'DallasFtWorth', 'Denver',
       'Detroit', 'GrandRapids', 'GreatLakes', 'HarrisburgScranton',
       'HartfordSpringfield', 'Houston', 'Indianapolis', 'Jacksonville',
       'LasVegas', 'LosAngeles', 'Louisville', 'MiamiFtLauderdale',
       'Midsouth', 'Nashville', 'NewOrleansMobile', 'NewYork',
       'Northeast', 'NorthernNewEngland', 'Orlando', 'Philadelphia',
       'PhoenixTucson', 'Pittsburgh', 'Plains', 'Portland',
       'RaleighGreensboro', 'RichmondNorfolk', 'Roanoke', 'Sacramento',
       'SanDiego', 'SanFrancisco', 'Seattle', 'SouthCarolina',
       'SouthCentral', 'Southeast', 'Spokane', 'StLouis', 'Syracuse',
       'Tampa', 'TotalUS', 'West', 'WestTexNewMexico'], dtype=object)

In [50]:
df["type"].unique()

array(['conventional', 'organic'], dtype=object)

###Filtramos los datos por el valor de las columnas

In [55]:
df2 = df[df["region"] == "Houston"]
df2.head()

,Unnamed: 0,Date,AveragePrice,Total Volume,4046,4225,4770,Total Bags,Small Bags,Large Bags,XLarge Bags,type,year,region
936,0,2015-12-27,0.78,944506.54,389773.22,288003.62,126150.81,140578.89,73711.94,36493.62,30373.33,conventional,2015,Houston
937,1,2015-12-20,0.75,922355.67,382444.22,278067.11,127372.19,134472.15,72198.16,31520.66,30753.33,conventional,2015,Houston
938,2,2015-12-13,0.73,998752.95,412187.80,386865.21,81450.04,118249.90,69011.01,48622.22,616.67,conventional,2015,Houston
939,3,2015-12-06,0.74,989676.85,368528.91,490805.00,7041.19,123301.75,61020.31,62281.44,0.00,conventional,2015,Houston
940,4,2015-11-29,0.79,783225.98,391616.95,289533.68,4334.89,97740.46,67880.28,29860.18,0.00,conventional,2015,Houston

In [56]:
df2 = df[df.region != "Houston"]
df2.head()

,Unnamed: 0,Date,AveragePrice,Total Volume,4046,4225,4770,Total Bags,Small Bags,Large Bags,XLarge Bags,type,year,region
0,0,2015-12-27,1.33,64236.62,1036.74,54454.85,48.16,8696.87,8603.62,93.25,0.0,conventional,2015,Albany
1,1,2015-12-20,1.35,54876.98,674.28,44638.81,58.33,9505.56,9408.07,97.49,0.0,conventional,2015,Albany
2,2,2015-12-13,0.93,118220.22,794.70,109149.67,130.50,8145.35,8042.21,103.14,0.0,conventional,2015,Albany
3,3,2015-12-06,1.08,78992.15,1132.00,71976.41,72.58,5811.16,5677.40,133.76,0.0,conventional,2015,Albany
4,4,2015-11-29,1.28,51039.60,941.48,43838.39,75.78,6183.95,5986.26,197.69,0.0,conventional,2015,Albany

###Copia de un dataframe y renombrar columnas

In [59]:
df_copia = df.copy()
df_copia.head(1)

,Unnamed: 0,Date,AveragePrice,Total Volume,4046,4225,4770,Total Bags,Small Bags,Large Bags,XLarge Bags,type,year,region
0,0,2015-12-27,1.33,64236.62,1036.74,54454.85,48.16,8696.87,8603.62,93.25,0.0,conventional,2015,Albany

In [60]:
df_copia.rename(columns = {"Unnamed: 0": "unnamed", "Total Bags": "total_bags", "Small Bags": "small_bags", "Total Volume": "total_volume", "Large Bags": "large_bags","XLarge Bags":"xlarge_bags" })

,unnamed,Date,AveragePrice,total_volume,4046,4225,4770,total_bags,small_bags,large_bags,xlarge_bags,type,year,region
0,0,2015-12-27,1.33,64236.62,1036.74,54454.85,48.16,8696.87,8603.62,93.25,0.0,conventional,2015,Albany
1,1,2015-12-20,1.35,54876.98,674.28,44638.81,58.33,9505.56,9408.07,97.49,0.0,conventional,2015,Albany
2,2,2015-12-13,0.93,118220.22,794.70,109149.67,130.50,8145.35,8042.21,103.14,0.0,conventional,2015,Albany
3,3,2015-12-06,1.08,78992.15,1132.00,71976.41,72.58,5811.16,5677.40,133.76,0.0,conventional,2015,Albany
4,4,2015-11-29,1.28,51039.60,941.48,43838.39,75.78,6183.95,5986.26,197.69,0.0,conventional,2015,Albany
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
18244,7,2018-02-04,1.63,17074.83,2046.96,1529.20,0.00,13498.67,13066.82,431.85,0.0,organic,2018,WestTexNewMexico
18245,8,2018-01-28,1.71,13888.04,1191.70,3431.50,0.00,9264.84,8940.04,324.80,0.0,organic,2018,WestTexNewMexico
18246,9,2018-01-21,1.87,13766.76,1191.92,2452.79,727.94,9394.11,9351.80,42.31,0.0,organic,2018,WestTexNewMexico
18247,10,2018-01-14,1.93,16205.22,1527.63,2981.04,727.01,10969.54,10919.54,50.00,0.0,organic,2018,WestTexNewMexico
18248,11,2018-01-07,1.62,17489.58,2894.77,2356.13,224.53,12014.15,11988.14,26.01,0.0,organic,2018,WestTexNewMexico

In [62]:
diccio_columnas = {"Unnamed: 0": "unnamed", "Total Bags": "total_bags", "Small Bags": "small_bags", "Total Volume": "total_volume", "Large Bags": "large_bags","XLarge Bags":"xlarge_bags" }

In [65]:
#Utilizamos el inplace=True para que se ejecute la acci칩n sobre el dataframe
df.rename(columns=diccio_columnas, inplace = True)

In [74]:
# Podr칤amos guardarlo en una nueva variable
data = df.rename(columns = diccio_columnas)
data.head()

,unnamed,Date,AveragePrice,total_volume,4046,4225,4770,total_bags,small_bags,large_bags,xlarge_bags,type,year,region
0,0,2015-12-27,1.33,64236.62,1036.74,54454.85,48.16,8696.87,8603.62,93.25,0.0,conventional,2015,Albany
1,1,2015-12-20,1.35,54876.98,674.28,44638.81,58.33,9505.56,9408.07,97.49,0.0,conventional,2015,Albany
2,2,2015-12-13,0.93,118220.22,794.70,109149.67,130.50,8145.35,8042.21,103.14,0.0,conventional,2015,Albany
3,3,2015-12-06,1.08,78992.15,1132.00,71976.41,72.58,5811.16,5677.40,133.76,0.0,conventional,2015,Albany
4,4,2015-11-29,1.28,51039.60,941.48,43838.39,75.78,6183.95,5986.26,197.69,0.0,conventional,2015,Albany

In [75]:
#O podr칤amos machacar la variable df 
df = df.rename(columns = diccio_columnas)
df.head()

,unnamed,Date,AveragePrice,total_volume,4046,4225,4770,total_bags,small_bags,large_bags,xlarge_bags,type,year,region
0,0,2015-12-27,1.33,64236.62,1036.74,54454.85,48.16,8696.87,8603.62,93.25,0.0,conventional,2015,Albany
1,1,2015-12-20,1.35,54876.98,674.28,44638.81,58.33,9505.56,9408.07,97.49,0.0,conventional,2015,Albany
2,2,2015-12-13,0.93,118220.22,794.70,109149.67,130.50,8145.35,8042.21,103.14,0.0,conventional,2015,Albany
3,3,2015-12-06,1.08,78992.15,1132.00,71976.41,72.58,5811.16,5677.40,133.76,0.0,conventional,2015,Albany
4,4,2015-11-29,1.28,51039.60,941.48,43838.39,75.78,6183.95,5986.26,197.69,0.0,conventional,2015,Albany

####Podemos renombrar las columnas machacando el atributo de la instancia... 쯢s suena esto?

In [76]:
columnas = list(df.columns)
columnas

['unnamed',
 'Date',
 'AveragePrice',
 'total_volume',
 '4046',
 '4225',
 '4770',
 'total_bags',
 'small_bags',
 'large_bags',
 'xlarge_bags',
 'type',
 'year',
 'region']

In [79]:
columnas_mayus = [str(columna).upper() for columna in columnas]

In [80]:
df.columns = columnas_mayus

In [81]:
df.head(2)

,UNNAMED,DATE,AVERAGEPRICE,TOTAL_VOLUME,4046,4225,4770,TOTAL_BAGS,SMALL_BAGS,LARGE_BAGS,XLARGE_BAGS,TYPE,YEAR,REGION
0,0,2015-12-27,1.33,64236.62,1036.74,54454.85,48.16,8696.87,8603.62,93.25,0.0,conventional,2015,Albany
1,1,2015-12-20,1.35,54876.98,674.28,44638.81,58.33,9505.56,9408.07,97.49,0.0,conventional,2015,Albany

### Borramos columnas

In [82]:
df = df.drop(['4046','4225','4770',"UNNAMED"], axis = 1) # Axis 1 siempre columnas

In [85]:
df.head()

,DATE,AVERAGEPRICE,TOTAL_VOLUME,TOTAL_BAGS,SMALL_BAGS,LARGE_BAGS,XLARGE_BAGS,TYPE,YEAR,REGION
0,2015-12-27,1.33,64236.62,8696.87,8603.62,93.25,0.0,conventional,2015,Albany
1,2015-12-20,1.35,54876.98,9505.56,9408.07,97.49,0.0,conventional,2015,Albany
2,2015-12-13,0.93,118220.22,8145.35,8042.21,103.14,0.0,conventional,2015,Albany
3,2015-12-06,1.08,78992.15,5811.16,5677.40,133.76,0.0,conventional,2015,Albany
4,2015-11-29,1.28,51039.60,6183.95,5986.26,197.69,0.0,conventional,2015,Albany

### Borramos filas

In [88]:
df.drop([0,1,2], axis = 0, inplace= True)

In [89]:
df.head()

,DATE,AVERAGEPRICE,TOTAL_VOLUME,TOTAL_BAGS,SMALL_BAGS,LARGE_BAGS,XLARGE_BAGS,TYPE,YEAR,REGION
3,2015-12-06,1.08,78992.15,5811.16,5677.40,133.76,0.0,conventional,2015,Albany
4,2015-11-29,1.28,51039.60,6183.95,5986.26,197.69,0.0,conventional,2015,Albany
5,2015-11-22,1.26,55979.78,6683.91,6556.47,127.44,0.0,conventional,2015,Albany
6,2015-11-15,0.99,83453.76,8318.86,8196.81,122.05,0.0,conventional,2015,Albany
7,2015-11-08,0.98,109428.33,6829.22,6266.85,562.37,0.0,conventional,2015,Albany

Las filas tambi칠n se pueden eliminar. Ten en cuenta que los 칤ndices no se reinician. El 칤ndice se asocia a la fila, no a la orden.   
쯉e puede reiniciar el index? Correcto

###Reset_index y set_index

Leemos la [documentaci칩n](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.reset_index.html) para entender algunos par치metros

In [93]:
#Drop = True evita que se genere otra columna con el index anterior
df = df.reset_index()
df.head()

,index,DATE,AVERAGEPRICE,TOTAL_VOLUME,TOTAL_BAGS,SMALL_BAGS,LARGE_BAGS,XLARGE_BAGS,TYPE,YEAR,REGION
0,3,2015-12-06,1.08,78992.15,5811.16,5677.40,133.76,0.0,conventional,2015,Albany
1,4,2015-11-29,1.28,51039.60,6183.95,5986.26,197.69,0.0,conventional,2015,Albany
2,5,2015-11-22,1.26,55979.78,6683.91,6556.47,127.44,0.0,conventional,2015,Albany
3,6,2015-11-15,0.99,83453.76,8318.86,8196.81,122.05,0.0,conventional,2015,Albany
4,7,2015-11-08,0.98,109428.33,6829.22,6266.85,562.37,0.0,conventional,2015,Albany

In [95]:
df.reset_index(drop=True, inplace=False)

,index,DATE,AVERAGEPRICE,TOTAL_VOLUME,TOTAL_BAGS,SMALL_BAGS,LARGE_BAGS,XLARGE_BAGS,TYPE,YEAR,REGION
0,3,2015-12-06,1.08,78992.15,5811.16,5677.40,133.76,0.0,conventional,2015,Albany
1,4,2015-11-29,1.28,51039.60,6183.95,5986.26,197.69,0.0,conventional,2015,Albany
2,5,2015-11-22,1.26,55979.78,6683.91,6556.47,127.44,0.0,conventional,2015,Albany
3,6,2015-11-15,0.99,83453.76,8318.86,8196.81,122.05,0.0,conventional,2015,Albany
4,7,2015-11-08,0.98,109428.33,6829.22,6266.85,562.37,0.0,conventional,2015,Albany

In [98]:
df.drop("index", axis = 1, inplace=True)

In [99]:
df.head()

,DATE,AVERAGEPRICE,TOTAL_VOLUME,TOTAL_BAGS,SMALL_BAGS,LARGE_BAGS,XLARGE_BAGS,TYPE,YEAR,REGION
0,2015-12-06,1.08,78992.15,5811.16,5677.40,133.76,0.0,conventional,2015,Albany
1,2015-11-29,1.28,51039.60,6183.95,5986.26,197.69,0.0,conventional,2015,Albany
2,2015-11-22,1.26,55979.78,6683.91,6556.47,127.44,0.0,conventional,2015,Albany
3,2015-11-15,0.99,83453.76,8318.86,8196.81,122.05,0.0,conventional,2015,Albany
4,2015-11-08,0.98,109428.33,6829.22,6266.85,562.37,0.0,conventional,2015,Albany

###Operaciones entre columnas

In [100]:
# Para generar una columna nueva solo tengo que ponerle un nombre

df["nueva"] = df.AVERAGEPRICE * df.XLARGE_BAGS
df.head()

,DATE,AVERAGEPRICE,TOTAL_VOLUME,TOTAL_BAGS,SMALL_BAGS,LARGE_BAGS,XLARGE_BAGS,TYPE,YEAR,REGION,nueva
0,2015-12-06,1.08,78992.15,5811.16,5677.40,133.76,0.0,conventional,2015,Albany,0.0
1,2015-11-29,1.28,51039.60,6183.95,5986.26,197.69,0.0,conventional,2015,Albany,0.0
2,2015-11-22,1.26,55979.78,6683.91,6556.47,127.44,0.0,conventional,2015,Albany,0.0
3,2015-11-15,0.99,83453.76,8318.86,8196.81,122.05,0.0,conventional,2015,Albany,0.0
4,2015-11-08,0.98,109428.33,6829.22,6266.85,562.37,0.0,conventional,2015,Albany,0.0

In [101]:
df["resta"] = df["TOTAL_VOLUME"] - df["TOTAL_BAGS"]
df.head()

,DATE,AVERAGEPRICE,TOTAL_VOLUME,TOTAL_BAGS,SMALL_BAGS,LARGE_BAGS,XLARGE_BAGS,TYPE,YEAR,REGION,nueva,resta
0,2015-12-06,1.08,78992.15,5811.16,5677.40,133.76,0.0,conventional,2015,Albany,0.0,73180.99
1,2015-11-29,1.28,51039.60,6183.95,5986.26,197.69,0.0,conventional,2015,Albany,0.0,44855.65
2,2015-11-22,1.26,55979.78,6683.91,6556.47,127.44,0.0,conventional,2015,Albany,0.0,49295.87
3,2015-11-15,0.99,83453.76,8318.86,8196.81,122.05,0.0,conventional,2015,Albany,0.0,75134.90
4,2015-11-08,0.98,109428.33,6829.22,6266.85,562.37,0.0,conventional,2015,Albany,0.0,102599.11

##ㅁpply !!

Aplica una funci칩n a lo largo de un eje del DataFrame.      
[Lee la doc](https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.apply.html)

In [ ]:
#Creamos una funci칩n sencilla que vamos a aplicar

In [ ]:
#Hazlo con lambda!!

##Df .loc e .iloc

### Seleccionar filas y columnas en Pandas mediante posici칩n con iloc

El m칠todo iloc se utiliza en los DataFrames para seleccionar los elementos en base a su ubicaci칩n. Su sintaxis es data.iloc[<filas>, <columnas>], donde <filas> y <columnas> son la posici칩n de las filas y columnas que se desean seleccionar en el orden que aparecen en el objeto. Una notaci칩n familiar para los usuarios de Matlab. En un DataFrame cada una de las filas tiene un n칰mero que va desde 0 hasta el total de filas menos uno. Siendo iloc el m칠todo que permite seleccionar los datos en base a estos n칰meros. Lo mismo que aplica a las columnas.

En iloc hay dos argumentos filas y columnas. En caso de que se omita el segundo, se seleccionar치n todas las columnas de la fila. As칤 para seleccionar diferentes filas se puede utilizar.

In [ ]:
#seleccionamos un registro completo

In [ ]:
#un rango de registros con sliding

In [ ]:
# Primera columna

### Seleccionar filas y columnas en Pandas en base a etiquetas con loc
El m칠todo loc se puede usar de dos formas diferentes: seleccionar filas o columnas en base a una etiqueta o seleccionar filas o columnas en base a una condici칩n.

#### En base a etiqueta

####En base a una condici칩n
Quiz치s esta sea una de las opciones m치s interesantes de las vistas, ya que permite seleccionar los datos en un DataFrame en base condiciones l칩gicas. Las cuales se pueden obtener a partir de los valores

쯈ueremos meterle m치s de una doncidici칩n? let`s go!

Misma operaci칩n, pero dame solo columnas concretas

##ㅁn치lisis exploratorio de un dataframe

In [106]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 18246 entries, 0 to 18245
Data columns (total 12 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   DATE          18246 non-null  object
 1   AVERAGEPRICE  18246 non-null  float64
 2   TOTAL_VOLUME  18246 non-null  float64
 3   TOTAL_BAGS    18246 non-null  float64
 4   SMALL_BAGS    18246 non-null  float64
 5   LARGE_BAGS    18246 non-null  float64
 6   XLARGE_BAGS   18246 non-null  float64
 7   TYPE          18246 non-null  object
 8   YEAR          18246 non-null  int64
 9   REGION        18246 non-null  object
 10  nueva         18246 non-null  float64
 11  resta         18246 non-null  float64
dtypes: float64(8), int64(1), object(3)
memory usage: 1.7+ MB

In [103]:
df.shape

(18246, 12)

In [105]:
df.describe()

,AVERAGEPRICE,TOTAL_VOLUME,TOTAL_BAGS,SMALL_BAGS,LARGE_BAGS,XLARGE_BAGS,YEAR,nueva,resta
count,18246.000000,1.824600e+04,1.824600e+04,1.824600e+04,1.824600e+04,18246.000000,18246.000000,18246.000000,1.824600e+04
mean,1.406012,8.507709e+05,2.396772e+05,1.822232e+05,5.434701e+04,3106.937265,2016.148087,3530.411734,6.110937e+05
std,0.402694,3.453815e+06,9.863190e+05,7.462365e+05,2.439850e+05,17694.304357,0.939900,20212.601239,2.517996e+06
min,0.440000,8.456000e+01,0.000000e+00,0.000000e+00,0.000000e+00,0.000000,2015.000000,0.000000,2.000000e+00
25%,1.100000,1.083647e+04,5.084710e+03,2.847965e+03,1.280175e+02,0.000000,2015.000000,0.000000,4.969667e+03
50%,1.370000,1.074040e+05,3.976482e+04,2.637781e+04,2.649285e+03,0.000000,2016.000000,0.000000,5.820127e+04
75%,1.660000,4.331048e+05,1.107878e+05,8.333783e+04,2.203605e+04,133.002500,2017.000000,152.043000,3.078713e+05
max,3.250000,6.250565e+07,1.937313e+07,1.338459e+07,5.719097e+06,551693.650000,2018.000000,584795.269000,4.473616e+07

In [108]:
df.AVERAGEPRICE.min()

0.44

In [109]:
df.AVERAGEPRICE.max()

3.25

In [110]:
df.AVERAGEPRICE.sum()

25654.089999999997

In [111]:
df.YEAR.value_counts()

2017    5722
2016    5616
2015    5612
2018    1296
Name: YEAR, dtype: int64

In [112]:
df.dtypes

DATE             object
AVERAGEPRICE    float64
TOTAL_VOLUME    float64
TOTAL_BAGS      float64
SMALL_BAGS      float64
LARGE_BAGS      float64
XLARGE_BAGS     float64
TYPE             object
YEAR              int64
REGION           object
nueva           float64
resta           float64
dtype: object

### Buscamos valores nulos

In [ ]:
import seaborn as sns

In [ ]:
# Usemos sort values de las series para ordenar los valores y verlo m치s claramente

###Borramos los valores nulos
Hay varias formas de hacerlo, tenemos en cuenta el par치metro "how" y, desde luego, [nos leemos la documentaci칩n](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.dropna.html).

In [ ]:
#Con "all" borramos donde TODOS los registros sean NaN

Con "any" (par치metro que viene by default as칤 que ojo con no poner nada) se borran todos los registros en los que en alguna columna haya un NaN

### C칩mo rellenar los datos que faltan

쯈u칠 os parece un poquito de [documentaci칩n](https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.fillna.html)?

In [ ]:
df = sns.load_dataset("titanic")

##ㅁgregaci칩n de datos
Un DataFrame puede agruparse en sus filas (eje=0) o en sus columnas (eje=1). Una vez hecho esto, se aplica una funci칩n a cada grupo, produciendo un nuevo valor. Finalmente, los resultados de todas esas aplicaciones de funciones se combinan en un objeto resultado. La forma del objeto resultante depender치 normalmente de lo que se haga con los datos.

In [ ]:
import numpy as np

In [ ]:
df = pd.DataFrame({'key1' : ['a', 'a', 'b', 'b', 'a'], 'key2' : ['one', 'two', 'one', 'two', 'one'],'data1' : np.random.randn(5),'data2' : np.random.randn(5)})

Supongamos que queremos calcular la media de la columna data1 utilizando las etiquetas de key1. Hay varias formas de hacerlo. Una es acceder a datos1 y llamar a groupby con la columna (una Serie) en clave1:

Los datos (una Serie) han sido agregados seg칰n la clave de grupo, produciendo una nueva Serie que ahora est치 indexada por los valores 칰nicos de la columna clave1. El 칤ndice resultante tiene el nombre 'clave1' porque la columna DataFrame df['clave1'] lo hizo.    
Si en su lugar hubi칠ramos pasado m칰ltiples arrays como una lista, obtendr칤amos algo diferente:

Otra forma de groupby con sintaxis agg

In [14]:
df = pd.read_csv("netflix_titles.csv")
df.head()

,show_id,type,title,director,cast,country,date_added,release_year,rating,duration,listed_in,description
0,s1,TV Show,3%,NaN,"Jo칚o Miguel, Bianca Comparato, Michel Gomes, R...",Brazil,"August 14, 2020",2020,TV-MA,4 Seasons,"International TV Shows, TV Dramas, TV Sci-Fi &...",In a future where the elite inhabit an island ...
1,s2,Movie,7:19,Jorge Michel Grau,"Demi치n Bichir, H칠ctor Bonilla, Oscar Serrano, ...",Mexico,"December 23, 2016",2016,TV-MA,93 min,"Dramas, International Movies",After a devastating earthquake hits Mexico Cit...
2,s3,Movie,23:59,Gilbert Chan,"Tedd Chan, Stella Chung, Henley Hii, Lawrence ...",Singapore,"December 20, 2018",2011,R,78 min,"Horror Movies, International Movies","When an army recruit is found dead, his fellow..."
3,s4,Movie,9,Shane Acker,"Elijah Wood, John C. Reilly, Jennifer Connelly...",United States,"November 16, 2017",2009,PG-13,80 min,"Action & Adventure, Independent Movies, Sci-Fi...","In a postapocalyptic world, rag-doll robots hi..."
4,s5,Movie,21,Robert Luketic,"Jim Sturgess, Kevin Spacey, Kate Bosworth, Aar...",United States,"January 1, 2020",2008,PG-13,123 min,Dramas,A brilliant group of students become card-coun...

In [30]:
df.shape

(7787, 12)

In [31]:
df.describe()

       release_year
count   7787.000000
mean    2013.932580
std        8.757395
min     1925.000000
25%     2013.000000
50%     2017.000000
75%     2018.000000
max     2021.000000

In [21]:
df.sample(5)

,show_id,type,title,director,cast,country,date_added,release_year,rating,duration,listed_in,description
6580,s6581,Movie,The Legend of 420,Peter Spirer,NaN,United States,"December 1, 2017",2017,TV-MA,87 min,Documentaries,This documentary explores the growing trend of...
6992,s6993,Movie,The Wedding Party,Kemi Adetiba,"Adesua Etomi, Banky Wellington, Richard Mofe-D...",Nigeria,"April 15, 2017",2016,TV-14,101 min,"Comedies, Dramas, International Movies","As their big day arrives, a couple's lavish we..."
2254,s2255,Movie,Franca: Chaos and Creation,Francesco Carrozzini,NaN,"United States, Italy","October 1, 2017",2016,TV-MA,79 min,"Documentaries, International Movies",A documentary filmmaker chronicles the life an...
5381,s5382,Movie,Santa Claws,Glenn Miller,"Nicola Lambo, Evan Boymel, John P. Fowler, Eri...",United States,"November 17, 2017",2014,TV-PG,86 min,"Children & Family Movies, Comedies",When a gift sack full of kittens gives Santa a...
6556,s6557,Movie,The Last Days of Chez Nous,Gillian Armstrong,"Lisa Harrow, Bruno Ganz, Kerry Fox, Miranda Ot...",Australia,"November 1, 2016",1992,R,93 min,"Classic Movies, Dramas",Successful writer Beth's tepid marriage and ho...

In [23]:
df.country.unique()

array(['Brazil', 'Mexico', 'Singapore', 'United States', 'Turkey',
       'Egypt', 'India', 'Poland, United States', 'Thailand', 'Nigeria',
       nan, 'Norway, Iceland, United States', 'United Kingdom', 'Japan',
       'South Korea', 'Italy', 'Canada', 'Indonesia', 'Romania', 'Spain',
       'Iceland', 'South Africa, Nigeria', 'France',
       'United States, South Africa', 'Portugal, Spain',
       'Hong Kong, China, Singapore', 'United States, Germany',
       'South Africa, China, United States', 'Argentina',
       'United States, France, Serbia', 'Germany',
       'Denmark, France, Poland', 'Poland', 'Kenya',
       'New Zealand, United Kingdom', 'Pakistan', 'Australia',
       'Australia, United States', 'Mexico, United States',
       'United States, China', 'China, Hong Kong', 'Taiwan',
       'United States, United Kingdom', 'France, South Korea, Japan',
       'United States, Canada', 'United Kingdom, United States',
       'Netherlands, Denmark, South Africa', 'Canada, United States',
       'Denmark', 'Hong Kong', 'France, Netherlands, Singapore', 'China',
       'Philippines', 'United Kingdom, Spain, United States',
       'United Arab Emirates, United States', 'Netherlands',
       'United Kingdom, Hong Kong', 'Iran, France',
       'United States, United Kingdom, France',
       'United Kingdom, France, Belgium, United States, China',
       'Argentina, Brazil, France, Poland, Germany, Denmark',
       'Israel, United States', 'United States, Mexico',
       'Uruguay, Argentina, Spain', 'Singapore, France',
       'United Kingdom, United States, France, Germany',
       'Turkey, United States', 'Bulgaria, United States',
       'Australia, France', 'Hong Kong, Iceland, United States',
       'United Arab Emirates', 'United States, Chile',
       'Germany, France, Russia', 'Mauritius, South Africa',
       'United States, Japan', 'Lebanon', 'United States, Bulgaria',
       'Colombia', 'Uruguay, Argentina', 'Egypt, Algeria',
       'France, Egypt', 'Uruguay', 'Soviet Union, India',
       'Sweden, United States', 'South Africa', 'Malaysia',
       'Ireland, United Kingdom, United States', 'Spain, Italy',
       'United Kingdom, France, Germany',
       'United States, Germany, Canada', 'United States, India',
       'Japan, United States', 'Denmark, United States',
       'South Africa, United States', 'Canada, Luxembourg',
       'Serbia, United States', 'Canada, Nigeria',
       'Iceland, Sweden, Belgium', 'Ireland, Canada',
       'United States, Italy', 'Finland', 'India, Germany',
       'China, Spain, South Korea, United States', 'Spain, Belgium',
       'United Kingdom, Canada, United States, Germany',
       'Brazil, Netherlands, United States, Colombia, Austria, Germany',
       'France, Canada, Belgium',
       'India, United Kingdom, China, Canada, Japan, South Korea, United States',
       'France, Belgium', 'Indonesia, South Korea, Singapore', 'Norway',
       'Peru', 'France, Senegal, Belgium', 'Canada, France', 'Chile',
       'Romania, France, Switzerland, Germany',
       'Bulgaria, United States, Spain, Canada', 'Sweden, Netherlands',
       'Ghana', 'France, United States, Mexico',
       'Australia, United Kingdom, United Arab Emirates, Canada',
       'Singapore, United States', 'Japan, Canada, United States',
       'Saudi Arabia',
       'Australia, Armenia, Japan, Jordan, Mexico, Mongolia, New Zealand, Philippines, South Africa, Sweden, United States, Uruguay',
       'United States, France', 'Norway, Denmark, Netherlands, Sweden',
       'Namibia', 'Mexico, Finland', 'United States, Australia', 'Russia',
       'Australia, Canada', 'United Kingdom, Ireland', 'Belgium, France',
       'New Zealand', 'Uruguay, Spain, Mexico', 'South Korea, China',
       'United States, Canada, Indonesia, United Kingdom, China, Singapore',
       'India, Iran', 'United States, France, Japan',
       'United Kingdom, France', 'Turkey, India', 'Philippines, Qatar',
       'Vietnam', 'Ireland, Luxembourg, Belgium',
       'Saudi Arabia, Syria, Egypt, Lebanon, Kuwait',
       'Russia, United States', 'United Kingdom, Russia, United States',
       'Argentina, Spain', 'Germany, Jordan, Netherlands',
       'Hong Kong, China', 'Argentina, United States',
       'France, Belgium, Spain', 'Germany, United States',
       'Denmark, Sweden, Israel, United States',
       'Ireland, United Kingdom', 'United States, Iceland',
       'United Arab Emirates, United Kingdom, India', 'Sweden',
       'Norway, Germany, Sweden', 'Finland, France', 'Denmark, Spain',
       'United Kingdom, Russia',
       'United States, United Kingdom, Australia',
       'India, United Kingdom', 'United States, Canada, Ireland',
       'Canada, United Kingdom',
       'United States, Israel, Italy, South Africa',
       'India, United States', 'United Kingdom, China',
       'Indonesia, Singapore', 'Netherlands, Denmark, France, Germany',
       'South Korea, Japan',
       'Philippines, Canada, United Kingdom, United States',
       'France, Malta, United States', 'Kuwait',
       'United Kingdom, Pakistan', 'Ireland', 'France, New Zealand',
       'United Kingdom, United States, Australia',
       'United Kingdom, Czech Republic, United States, Germany, Bahamas',
       'United States, Australia, China',
       'China, Germany, India, United States', 'Germany, Sri Lanka',
       'United States, Sweden', 'Canada, United States, Cayman Islands',
       'India, France', 'United Kingdom, Canada',
       'United States, India, Bangladesh',
       'United States, Canada, France',
       'Taiwan, China, France, United States', 'Brazil, France, Germany',
       'United States,', 'Turkey, France, Germany, Poland',
       'Australia, New Zealand, United States',
       'Germany, United States, Hong Kong, Singapore',
       'France, Germany, Switzerland', 'Mexico, Argentina',
       'Italy, United States, Argentina',
       'Germany, France, Luxembourg, United Kingdom, United States',
       'Canada, United States, United Kingdom',
       'United Kingdom, Canada, Italy', 'Czech Republic, France',
       'Zimbabwe', 'United Kingdom, France, Germany, Spain',
       'Taiwan, Hong Kong, United States, China', 'China, United States',
       'Canada, Brazil', 'United Kingdom, Australia', 'Hungary',
       'Germany, Australia', 'United Kingdom, Poland, United States',
       'Bulgaria', 'Philippines, United States', 'Finland, Germany',
       'United States, Thailand',
       'Spain, Belgium, Switzerland, United States, China, United Kingdom',
       'Denmark, Zimbabwe', 'United Kingdom, South Africa',
       'Finland, Sweden, Norway, Latvia, Germany',
       'United Kingdom, India',
       'South Africa, United States, New Zealand, Canada',
       'France, Qatar', 'France, Algeria',
       'United States, Italy, United Kingdom, Liechtenstein',
       'Denmark, France, Belgium, Italy, Netherlands, United States, United Kingdom',
       'United States, Australia, Mexico',
       'United Kingdom, Czech Republic, Germany, United States',
       'Russia, Poland, Serbia', 'France, China, Japan, United States',
       'United States, South Korea, China', 'Germany, Belgium',
       'Chile, Argentina', 'China, United States, United Kingdom',
       'Pakistan, Norway, United States',
       'United Kingdom, Japan, United States', 'Philippines, Singapore',
       'United States, Canada, Belgium, United Kingdom', 'Venezuela',
       'Argentina, Uruguay, Serbia', 'United States, Mexico, Colombia',
       'Colombia, Peru, United Kingdom', 'Brazil, United States',
       'Czech Republic, United States',
       'Canada, France, Italy, Morocco, United States',
       'Canada, Spain, France', 'Hong Kong, United States',
       'France, Canada, China, Cambodia', 'United States, Indonesia',
       'Spain, France', 'Spain, Mexico, France', 'Spain, France, Italy',
       'Spain, France, United States', 'United States, France, Canada',
       'Israel', 'Italy, France', 'United Kingdom, Canada, United States',
       'Cambodia, United States', 'China, Japan',
       'United Arab Emirates, United States, United Kingdom',
       'Argentina, Italy', 'United Kingdom, Israel, Russia',
       'Italy, Switzerland, Albania, Poland', 'Spain, Cuba',
       'United States, Brazil', 'United States, France, Mexico',
       'United States, Nicaragua', 'Austria, Germany',
       'United Arab Emirates, Jordan, Lebanon',
       'France, United Kingdom, United States',
       'United Kingdom, United States, Spain, Germany, Greece, Canada',
       'France, Belgium, Luxembourg, Cambodia,', 'Italy, Turkey',
       'Brazil, France', 'India, Turkey', 'Kenya, United States',
       'United States, South Korea', 'South Korea, United States',
       'Italy, Canada, France', 'Thailand, United States',
       'United Kingdom, Denmark, Canada, Croatia', 'Netherlands, Belgium',
       'United Kingdom, Canada, United States, Cayman Islands',
       'Italy, Germany', 'United States, France, United Kingdom, Japan',
       'United States, United Kingdom, Denmark, Sweden',
       'United States, United Kingdom, Italy',
       'United States, France, Canada, Spain', 'Uruguay, Guatemala',
       'Germany, Australia, France, China',
       'United States, United Kingdom, Japan',
       'United States, United Kingdom, Canada',
       'Italy, Switzerland, France, Germany',
       'Russia, United States, China', 'United States, Canada, Germany',
       'United States, Czech Republic', 'Ireland, United States',
       'United States, United Arab Emirates',
       'France, Australia, Germany', 'Hong Kong, China, United States',
       'Lebanon, United Arab Emirates, France, Switzerland, Germany',
       'United States, South Korea, Japan', 'Romania, United States',
       'West Germany', 'United States, Ireland', 'Chile, Italy',
       'Ireland, United Kingdom, Italy, United States', 'Belgium',
       'Poland,', 'Slovenia, Croatia, Germany, Czech Republic, Qatar',
       'Canada, United Kingdom, Netherlands',
       'United Kingdom, United States, France',
       'Indonesia, United Kingdom', 'United States, Spain, Germany',
       'India, Japan', 'Switzerland, France, Belgium, United States',
       'China, South Korea, United States',
       'United Kingdom, France, Belgium',
       'Canada, Ireland, United States',
       'United Kingdom, United States, Dominican Republic',
       'United States, Senegal', 'Germany, United Kingdom, United States',
       'United States, Canada, United Kingdom',
       'Canada, United States, France', 'United Kingdom, Germany, Canada',
       'Argentina, France', 'South Africa, Germany, Netherlands, France',
       'Canada, United States, United Kingdom, France, Luxembourg',
       'Finland, Germany, Belgium',
       'United States, United Kingdom, Germany', 'Taiwan, China',
       'Cambodia', 'Spain, Portugal', 'Ireland, United States, France',
       'Jordan', 'Austria', 'Germany, United States, Canada',
       'United Kingdom, Germany, Canada, United States',
       'United States, France, Canada, Lebanon, Qatar',
       'Indonesia, Netherlands',
       'Netherlands, Belgium, United Kingdom, United States',
       'China, United States, Australia',
       'France, Belgium, China, United States', 'Spain, United Kingdom',
       'United States, Chile, Israel', 'Bangladesh',
       'United Kingdom, Norway, Denmark, Germany, Sweden',
       'United States, Japan, Canada', 'Norway, Denmark, Sweden',
       'China, India, Nepal', 'United States, Argentina',
       'Mexico, United States, Spain, Colombia',
       'Colombia, Mexico, United States',
       'United Kingdom, Belgium, Sweden', 'Nigeria, United Kingdom',
       'United Kingdom, South Korea', 'United States, Taiwan',
       'Netherlands, Belgium, Germany, Jordan', 'France, Canada',
       'United Kingdom, France, United States',
       'Denmark, Singapore, Canada, United States', 'Denmark, China',
       'Malaysia, Singapore, Hong Kong', 'Norway, United States',
       'United States, Philippines', 'United States, Greece, Brazil',
       'France, United States', 'South Korea, France',
       'United States, Australia, Samoa, United Kingdom',
       'Canada, South Africa', 'United Kingdom, Italy',
       'Germany, United Kingdom', 'China, United Kingdom',
       'Argentina, Chile, Peru', 'United States, Russia',
       'Uruguay, Germany', 'Turkey, Azerbaijan',
       'United States, China, Hong Kong',
       'Canada, Germany, France, United States',
       'Argentina, United States, Mexico',
       'France, United Kingdom, India', 'China, Taiwan',
       'Italy, United Kingdom, France', 'Poland, West Germany',
       'Germany, United States, Sweden', 'Canada, Spain',
       'United Kingdom, France, Belgium, United States', 'France, Japan',
       'Netherlands, Germany, Italy, Canada', 'United States, Cambodia',
       'United States, Greece', 'United States, China, Colombia',
       'United States, Spain, Italy',
       'Norway, United Kingdom, France, Ireland',
       'United States, Bermuda, Ecuador', 'United Kingdom, Poland',
       'China, Canada, United States', 'United States, Spain',
       'India, Mexico', 'United Kingdom, West Germany',
       'Pakistan, United States', 'Israel, Sweden, Germany, Netherlands',
       'Chile, United States, France', 'France, Morocco',
       'United Kingdom, Germany', 'Georgia, Germany, France',
       'Switzerland, France', 'Turkey, South Korea', 'Italy, India',
       'United States, Botswana', 'United States, Colombia, Mexico',
       'Chile, Argentina, France, Spain, United States',
       'Puerto Rico, United States, Colombia', 'United States, Nigeria',
       'Germany, United States, France',
       'Spain, Germany, Denmark, United States',
       'United Kingdom, United States, Japan',
       'Netherlands, United States',
       'United States, India, South Korea, China',
       'Denmark, Germany, Belgium, United Kingdom, France',
       'Denmark, Germany, Belgium, United Kingdom, France, Sweden',
       'France, Switzerland, Spain, United States, United Arab Emirates',
       'Norway, Sweden', 'United States, Ireland, United Kingdom, India',
       'United Kingdom, Singapore', 'Spain, Germany',
       'Germany, Czech Republic',
       'Denmark, Brazil, France, Portugal, Sweden',
       'Brazil, India, China, United States', 'India, Germany, Austria',
       'Italy, United States', 'Denmark, France, United States, Sweden',
       'Australia, Iraq', 'China, Morocco, Hong Kong', 'Spain, Colombia',
       'Australia, United Arab Emirates',
       'Canada, United States, Germany', 'France, Belgium, Italy',
       'United Kingdom, Thailand', 'Venezuela, Colombia',
       'France, Luxembourg, Canada', 'India, Nepal', 'Mexico, Spain',
       'Colombia, United States', 'Colombia, Mexico',
       'France, Germany, Czech Republic, Belgium',
       'Germany, China, United Kingdom', 'Canada, Hungary, United States',
       'Pakistan, United Arab Emirates', 'France, United Kingdom',
       'Spain, United Kingdom, United States', 'United Kingdom, Kenya',
       'United States, Norway, Canada', 'Canada, United States, Ireland',
       'Switzerland, Vatican City, Italy, Germany, France',
       'Portugal, France, Poland, United States',
       'France, Japan, United States', 'United States, New Zealand',
       'United States, New Zealand, Japan',
       'United States, Netherlands, Japan, France', 'India, Switzerland',
       'Canada, India', 'Canada, Japan, United States',
       'United States, Morocco', 'United States, Mexico, Spain, Malta',
       'Norway, Denmark', 'South Korea, Canada, United States, China',
       'Singapore, Japan, France',
       'Canada, Mexico, Germany, South Africa',
       'United Kingdom, United States, Canada',
       'Germany, France, United States, Canada, United Kingdom',
       'Peru, Germany, Norway', 'Singapore, Malaysia',
       'United States, Uruguay', 'India, Canada',
       'Ireland, Canada, United Kingdom, United States',
       'United States, Germany, Australia', 'Senegal',
       'Israel, Germany, France', 'Australia, France, Ireland',
       'South Africa, Angola', 'Austria, Czech Republic',
       'Australia, India', 'United States, United Kingdom, Canada, Japan',
       'Sweden, United Kingdom, Finland', 'Hong Kong, Taiwan',
       'United States, United Kingdom, Spain, South Korea',
       'South Korea, China, United States', 'Guatemala', 'Ukraine',
       'United States, United Kingdom, Canada, China',
       'Italy, South Africa, West Germany, Australia, United States',
       'United Kingdom, Finland, Germany',
       'South Africa, United States, Germany',
       'United States, Germany, United Kingdom, Australia',
       'India, Soviet Union', 'Italy, France, Switzerland',
       'Canada, France, United States', 'United States, Colombia',
       'India, Malaysia', 'Switzerland, United States',
       'Thailand, Canada, United States',
       'China, Hong Kong, United States', 'United Kingdom, New Zealand',
       'United Kingdom, France, Germany, United States',
       'South Korea, Czech Republic',
       'Czech Republic, United Kingdom, France',
       'Australia, United Kingdom, Canada',
       'Canada, United Kingdom, United States', 'United States, Hungary',
       'Jamaica, United States', 'Switzerland',
       'Australia, United Kingdom, United States, New Zealand, Italy, France',
       'France, United States, Canada', 'Australia, United Kingdom',
       'United States, Denmark',
       'United Kingdom, France, Canada, Belgium, United States',
       'Denmark, United Kingdom, Sweden', 'Belarus', 'Cyprus',
       'Lebanon, United States, United Arab Emirates',
       'United States, Hong Kong', 'United States, Kazakhstan',
       'Argentina, France, United States, Germany, Qatar',
       'United States, Germany, United Kingdom',
       'United States, Germany, United Kingdom, Italy',
       'United States, New Zealand, United Kingdom',
       'Finland, United States', 'Spain, France, Uruguay',
       'France, Belgium, United States', 'France, Canada, United States',
       'Spain, Argentina', 'United Kingdom, India, United States',
       'Chile, France',
       'United States, United Kingdom, France, Germany, Japan',
       'Canada, Norway', 'United States, Hungary, Ireland, Canada',
       'United States, Canada, China', 'United Kingdom, Malawi',
       'Ireland, Canada, Luxembourg, United States, United Kingdom, Philippines, India',
       'United States, Czech Republic, United Kingdom',
       'Ghana, United States', 'Israel, Germany', 'Spain, Mexico',
       'Mexico, France', 'Brazil, United Kingdom',
       'France, Belgium, Luxembourg, Romania, Canada, United States',
       'Israel, Germany, Poland, Luxembourg, Belgium, France, United States',
       'France, Germany', 'United States, Malta, France, United Kingdom',
       'United Kingdom, United States, Germany, Denmark, Belgium, Japan',
       'Austria, United States', 'Canada, Australia',
       'Greece, United States',
       'United Kingdom, France, Belgium, Canada, United States',
       'Argentina, Chile', 'Czech Republic, Slovakia',
       'United Kingdom, Germany, United States, France',
       'United Kingdom, Lithuania', 'Egypt, France',
       'Spain, France, Canada', 'United States, Greece, United Kingdom',
       'United Kingdom, China, United States, India', 'Taiwan, Malaysia',
       'United States, Sweden, Norway',
       'United Kingdom, United States, Morocco',
       'United States, United Kingdom, Morocco',
       'United States, China, Canada', 'Spain, Canada, United States',
       'Canada, Belgium', 'United States, India, United Arab Emirates',
       'United Kingdom, Canada, France, United States',
       'Spain, Thailand, United States', 'Canada, Germany, South Africa',
       'India, Germany, France',
       'United States, Israel, United Kingdom, Canada',
       'United Kingdom, Hungary, Australia', 'Lebanon, France',

In [24]:
df.country.value_counts()

United States                                             2555
India                                                      923
United Kingdom                                             397
Japan                                                      226
South Korea                                                183
                                                          ...
United Kingdom, South Africa, Australia, United States       1
United Kingdom, China, United States, India                  1
United Kingdom, Germany, United States                       1
United States, Canada, China                                 1
Czech Republic, France                                       1
Name: country, Length: 681, dtype: int64

In [26]:
df_spain = df[df["country"] == "Spain"]
df_spain

,show_id,type,title,director,cast,country,date_added,release_year,rating,duration,listed_in,description
39,s40,Movie,"춰Ay, mi madre!",Frank Ariza,"Estefan칤a de los Santos, Secun de la Rosa, Ter...",Spain,"July 19, 2019",2019,TV-MA,81 min,"Comedies, International Movies","When her estranged mother suddenly dies, a wom..."
52,s53,Movie,100 Days Of Solitude,NaN,NaN,Spain,"July 6, 2018",2018,TV-MA,93 min,"Documentaries, International Movies",Spanish photographer Jos칠 D칤az spends 100 days...
74,s75,Movie,1898: Our Last Men in the Philippines,Salvador Calvo,"Luis Tosar, Javier Guti칠rrez, 츼lvaro Cervantes...",Spain,"June 2, 2017",2016,R,130 min,"Dramas, International Movies","While Spain relinquishes its last colonies, a ..."
112,s113,TV Show,45 rpm,NaN,"Carlos Cuevas, Guiomar Puerta, Iv치n Marcos, Is...",Spain,"August 16, 2019",2019,TV-MA,1 Season,"International TV Shows, Romantic TV Shows, Spa...","In 1960s Madrid, music producer Guillermo Roja..."
114,s115,Movie,4L,Gerardo Olivares,"Jean Reno, Hovik Keuchkerian, Susana Abaitua, ...",Spain,"July 12, 2019",2019,TV-MA,105 min,"Comedies, Dramas, Independent Movies","Hoping to reunite with a dying friend, two lon..."
...,...,...,...,...,...,...,...,...,...,...,...,...
7562,s7563,Movie,What the F* Is Going On?,"Marta Jaenes, Rosa M치rquez",NaN,Spain,"November 25, 2019",2019,TV-MA,87 min,"Documentaries, International Movies","Featuring extensive interviews, this documenta..."
7577,s7578,Movie,When Angels Sleep,Gonzalo Bendala,"Juli치n Villagr치n, Marian 츼lvarez, Ester Exp칩si...",Spain,"December 28, 2018",2018,TV-MA,96 min,"Dramas, International Movies, Thrillers",After a businessman falls asleep at the wheel ...
7608,s7609,Movie,Who Would You Take to a Deserted Island?,Jota Linares,"Mar칤a Pedraza, Jaime Lorente, Pol Monen, Andre...",Spain,"April 13, 2019",2019,TV-MA,94 min,"Dramas, International Movies","On their last night together, four longtime fl..."
7751,s7752,Movie,Yucat치n,Daniel Monz칩n,"Luis Tosar, Rodrigo de la Serna, Joan Pera, St...",Spain,"February 15, 2019",2018,TV-MA,130 min,"Comedies, International Movies",Competing con artists attempt to creatively an...
7772,s7773,Movie,Zipi & Zape y la Isla del Capitan,Oskar Santos,"Teo Planell, Toni G칩mez, Elena Anaya, Iria Cas...",Spain,"July 1, 2017",2016,TV-PG,105 min,"Children & Family Movies, Comedies","At Christmas, Zip and Zap take a trip with the..."

In [34]:
titles_list = list(df_spain.title)
titles_list

['춰Ay, mi madre!',
 '100 Days Of Solitude',
 '1898: Our Last Men in the Philippines',
 '45 rpm',
 '4L',
 '7 a침os',
 'A Remarkable Tale',
 'Ad칰',
 'Alejandro Sanz: What I Was Is What I Am',
 'Amar',
 'Anchor and Hope',
 'Apaches',
 'Bar칞a Dreams',
 'Between Worlds',
 'Bitter Daisies',
 'Black Man White Skin',
 'Boi',
 'Bomb Scared',
 'Born in Gaza',
 'Boy Missing',
 'Cable Girls',
 'Camar칩n: The Film',
 'Cathedral of the Sea',
 'Cleo & Cuquin',
 'Cocaine Coast',
 'Criminal: Spain',
 'Despite Everything',
 'Don뗪 Listen',
 'Drug Squad: Costa del Sol',
 'Dying to Tell',
 'El Barco',
 'El club de los buenos infieles',
 'El fin de ETA',
 'Elisa & Marcela',
 'Elite',
 "Eve's Apple",
 'Examination of Conscience',
 'Footprints: The Path of Your Life',
 'For Your Own Good',
 'Fugitiva',
 'Getaway Plan',
 'Grand Hotel',
 'Hache',
 'Heroes Wanted',
 'High Seas',
 'Holy Camp!',
 'Holy Goalie',
 'I love you, stupid',
 "If I Hadn't Met You",
 'In Family I Trust',
 "It's Now or Never",
 'La casa de papel',
 'La L칤nea: Shadow of Narco',
 'Live Twice, Love Once',
 'Lo que la verdad esconde: El caso Asunta (Operacion Nen칰far)',
 'Locked Up',
 'Mar de Pl치stico',
 'Merl칤',
 'Mirage',
 'Money Heist: The Phenomenon',
 'Mutant Busters',
 'My Big Night',
 'Nailed It! Spain',
 'Off Course',
 'Our Lovers',
 'Palm Trees in the Snow',
 'Paquita Salas',
 'Parch칤s: the Documentary',
 'Pocoyo & The Space Circus',
 'Sad Hill Unearthed',
 "Sara's Notebook",
 'Seventeen',
 'Sing On! Spain',
 'Skins',
 'Smoke & Mirrors',
 'Solo',
 'Something Huge',
 'Spanish Affair 2',
 'Spy Time',
 'Stolen Away',
 "Sunday's Illness",
 'Superlopez',
 'Take the Ball, Pass the Ball',
 'The Alc맙ser Murders',
 'The Barrier',
 'The Fury of a Patient Man',
 'The Giant',
 'The Girl from the Song',
 'The Heroes of Evil',
 'The Hockey Girls',
 'The Idhun Chronicles',
 'The Invisible Guest',
 'The Laws of Thermodynamics',
 'The Little Switzerland',
 'The Maus',
 'The Mess You Leave Behind',
 'The Minions of Midas',
 'The Ministry of Time',
 'The Neighbor',
 'The Occupant',
 'The Paramedic',
 'The Photographer Of Mauthausen',
 'The Reconquest',
 'The Silence of the Marsh',
 'The Silent War',
 'The Skin of the Wolf',
 'The Tree of Blood',
 'The Tribe',
 'The Warning',
 'Thi Mai',
 'Three Days of Christmas',
 'Tiempos de guerra',
 'Toc Toc',
 'Toro',
 'Toy Boy',
 'Twin Murders: the Silence of the White City',
 'Two Catalonias',
 'Unauthorized Living',
 'Unbridled',
 'Uncertain Glory',
 'Unknown Origins',
 'Up Among  The Stars',
 'Valeria',
 'Velvet',
 'Velvet Colecci칩n',
 'Veronica',
 'Victim Number 8',
 'We Need to Talk',
 'Welcome to the Family',
 'What the F* Is Going On?',
 'When Angels Sleep',
 'Who Would You Take to a Deserted Island?',
 'Yucat치n',
 'Zipi & Zape y la Isla del Capitan']

In [38]:
df_spain.release_year.value_counts()

2018    32
2019    24
2017    24
2020    22
2016    16
2015    11
2013     2
2021     1
2014     1
2008     1
Name: release_year, dtype: int64

In [39]:
df.release_year.value_counts()

2018    1121
2017    1012
2019     996
2016     882
2020     868
        ...
1966       1
1947       1
1959       1
1964       1
1925       1
Name: release_year, Length: 73, dtype: int64

## Summaary

## Further materials

* [Read the docs!](https://pandas.pydata.org/pandas-docs/stable/index.html)
* [Cheatsheet](https://pandas.pydata.org/Pandas_Cheat_Sheet.pdf)
* [Exercises to practice](https://github.com/guipsamora/pandas_exercises)
* [More on merge, concat, and join](https://realpython.com/pandas-merge-join-and-concat/#pandas-join-combining-data-on-a-column-or-index). And [even more!](https://pandas.pydata.org/pandas-docs/stable/user_guide/merging.html)
* [Materials by a friend of a friend Juan Huguet](https://github.com/juanhuguetgarcia/uib-aa-g1-material/tree/master/W1%20-%20Intro%20to%20python%20y%20pandas)